In [0]:
# data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [0]:
train_df = pd.read_csv('Pendapatan.csv')
test_df = pd.read_csv('Pendapatan_test.csv')
combine = [train_df, test_df]

In [0]:
train_df.head()

      id  Umur  ... Jam per Minggu  Gaji
0  27247    59  ...           50.0     1
1   1640    52  ...           38.0     0
2  45206    52  ...           99.0     1
3  16154    45  ...           40.0     0
4  43023    28  ...           45.0     1

[5 rows x 13 columns]

In [0]:
test_df.head()

      id  Umur  ... Kerugian Capital  Jam per Minggu
0  47933    30  ...              0.0            40.0
1  44213    28  ...              0.0            50.0
2  20823    34  ...              0.0            40.0
3  40565    51  ...       28028000.0            40.0
4   9860    20  ...       22428000.0            40.0

[5 rows x 12 columns]

In [0]:
print(train_df.columns.values)

['id' 'Umur' 'Kelas Pekerja' 'Berat Akhir' 'Pendidikan'
 'Jmlh Tahun Pendidikan' 'Status Perkawinan' 'Pekerjaan' 'Jenis Kelamin'
 'Keuntungan Kapital' 'Kerugian Capital' 'Jam per Minggu' 'Gaji']

In [0]:
train_df.head()

      id  Umur  ... Jam per Minggu  Gaji
0  27247    59  ...           50.0     1
1   1640    52  ...           38.0     0
2  45206    52  ...           99.0     1
3  16154    45  ...           40.0     0
4  43023    28  ...           45.0     1

[5 rows x 13 columns]

In [0]:
train_df.info()
print('_'*40)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38393 entries, 0 to 38392
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     38393 non-null  int64
 1   Umur                   38393 non-null  int64
 2   Kelas Pekerja          38393 non-null  object
 3   Berat Akhir            38393 non-null  int64
 4   Pendidikan             38393 non-null  object
 5   Jmlh Tahun Pendidikan  38393 non-null  int64
 6   Status Perkawinan      38393 non-null  object
 7   Pekerjaan              38393 non-null  object
 8   Jenis Kelamin          38393 non-null  object
 9   Keuntungan Kapital     38393 non-null  float64
 10  Kerugian Capital       38393 non-null  float64
 11  Jam per Minggu         38393 non-null  float64
 12  Gaji                   38393 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 3.8+ MB
________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9599 entries, 0 to 9598
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     9599 non-null   int64
 1   Umur                   9599 non-null   int64
 2   Kelas Pekerja          9599 non-null   object
 3   Berat Akhir            9599 non-null   int64
 4   Pendidikan             9599 non-null   object
 5   Jmlh Tahun Pendidikan  9599 non-null   int64
 6   Status Perkawinan      9599 non-null   object
 7   Pekerjaan              9599 non-null   object
 8   Jenis Kelamin          9599 non-null   object
 9   Keuntungan Kapital     9599 non-null   float64
 10  Kerugian Capital       9599 non-null   float64
 11  Jam per Minggu         9599 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 900.0+ KB

In [0]:
train_df.describe()

                 id          Umur  ...  Jam per Minggu          Gaji
count  38393.000000  38393.000000  ...    38393.000000  38393.000000
mean   24015.248535     38.673925  ...       40.440627      0.239497
std    13872.059919     13.694678  ...       12.382695      0.426782
min        0.000000     17.000000  ...        1.000000      0.000000
25%    11989.000000     28.000000  ...       40.000000      0.000000
50%    24050.000000     37.000000  ...       40.000000      0.000000
75%    36031.000000     48.000000  ...       45.000000      0.000000
max    47991.000000     90.000000  ...       99.000000      1.000000

[8 rows x 8 columns]

In [0]:
train_df.describe(include=['O'])

       Kelas Pekerja Pendidikan Status Perkawinan  Pekerjaan Jenis Kelamin
count          38393      38393             38393      38393         38393
unique             9         16                 6         15             2
top       Wiraswasta        SMA           Menikah  Spesialis         Laki2
freq           26589      12430             17640       4911         25708

In [0]:
train_df_null = train_df.replace('?',np.NAN) 
train_df_null.isnull().sum()

id                          0
Umur                        0
Kelas Pekerja            2204
Berat Akhir                 0
Pendidikan                  0
Jmlh Tahun Pendidikan       0
Status Perkawinan           0
Pekerjaan                2210
Jenis Kelamin               0
Keuntungan Kapital          0
Kerugian Capital            0
Jam per Minggu              0
Gaji                        0
dtype: int64

In [0]:
test_df_null = test_df.replace('?',np.NAN) 
test_df_null.isnull().sum()

id                         0
Umur                       0
Kelas Pekerja            552
Berat Akhir                0
Pendidikan                 0
Jmlh Tahun Pendidikan      0
Status Perkawinan          0
Pekerjaan                554
Jenis Kelamin              0
Keuntungan Kapital         0
Kerugian Capital           0
Jam per Minggu             0
dtype: int64

In [0]:
test_df['Kelas Pekerja'] = test_df['Kelas Pekerja'].replace('?','Wiraswasta')
test_df['Pekerjaan'] = test_df['Pekerjaan'].replace('?','Spesialis')
test_df.head()

      id  Umur  ... Kerugian Capital  Jam per Minggu
0  47933    30  ...              0.0            40.0
1  44213    28  ...              0.0            50.0
2  20823    34  ...              0.0            40.0
3  40565    51  ...       28028000.0            40.0
4   9860    20  ...       22428000.0            40.0

[5 rows x 12 columns]

In [0]:
train_df['Kelas Pekerja'] = train_df['Kelas Pekerja'].replace('?','Wiraswasta')
train_df['Pekerjaan'] = train_df['Pekerjaan'].replace('?','Spesialis')
train_df.head()

      id  Umur  ... Jam per Minggu  Gaji
0  27247    59  ...           50.0     1
1   1640    52  ...           38.0     0
2  45206    52  ...           99.0     1
3  16154    45  ...           40.0     0
4  43023    28  ...           45.0     1

[5 rows x 13 columns]

In [0]:
from sklearn.preprocessing import LabelEncoder

# tipe data

In [0]:
train_df.info()
print('_'*40)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38393 entries, 0 to 38392
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     38393 non-null  int64
 1   Umur                   38393 non-null  int64
 2   Kelas Pekerja          38393 non-null  object
 3   Berat Akhir            38393 non-null  int64
 4   Pendidikan             38393 non-null  object
 5   Jmlh Tahun Pendidikan  38393 non-null  int64
 6   Status Perkawinan      38393 non-null  object
 7   Pekerjaan              38393 non-null  object
 8   Jenis Kelamin          38393 non-null  object
 9   Keuntungan Kapital     38393 non-null  float64
 10  Kerugian Capital       38393 non-null  float64
 11  Jam per Minggu         38393 non-null  float64
 12  Gaji                   38393 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 3.8+ MB
________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9599 entries, 0 to 9598
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     9599 non-null   int64
 1   Umur                   9599 non-null   int64
 2   Kelas Pekerja          9599 non-null   object
 3   Berat Akhir            9599 non-null   int64
 4   Pendidikan             9599 non-null   object
 5   Jmlh Tahun Pendidikan  9599 non-null   int64
 6   Status Perkawinan      9599 non-null   object
 7   Pekerjaan              9599 non-null   object
 8   Jenis Kelamin          9599 non-null   object
 9   Keuntungan Kapital     9599 non-null   float64
 10  Kerugian Capital       9599 non-null   float64
 11  Jam per Minggu         9599 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 900.0+ KB

In [0]:
clean_df = train_df

In [0]:
clean_df.head()

      id  Umur  ... Jam per Minggu  Gaji
0  27247    59  ...           50.0     1
1   1640    52  ...           38.0     0
2  45206    52  ...           99.0     1
3  16154    45  ...           40.0     0
4  43023    28  ...           45.0     1

[5 rows x 13 columns]

In [0]:
from sklearn.preprocessing import OneHotEncoder
OneHotEncoder().fit_transform(clean_df)

<38393x63237 sparse matrix of type '<class 'numpy.float64'>'
	with 499109 stored elements in Compressed Sparse Row format>

In [0]:
clean_df.dtypes

id                         int64
Umur                       int64
Kelas Pekerja             object
Berat Akhir                int64
Pendidikan                object
Jmlh Tahun Pendidikan      int64
Status Perkawinan         object
Pekerjaan                 object
Jenis Kelamin             object
Keuntungan Kapital       float64
Kerugian Capital         float64
Jam per Minggu           float64
Gaji                       int64
dtype: object

In [0]:
for column in clean_df.columns:
  if clean_df[column].dtype != 'int64' and clean_df[column].dtype != 'float64':
    clean_df[column] = LabelEncoder().fit_transform(clean_df[column])

In [0]:
clean_df.head()

      id  Umur  Kelas Pekerja  ...  Kerugian Capital  Jam per Minggu  Gaji
0  27247    59              3  ...               0.0            50.0     1
1   1640    52              7  ...               0.0            38.0     0
2  45206    52              0  ...               0.0            99.0     1
3  16154    45              7  ...               0.0            40.0     0
4  43023    28              7  ...               0.0            45.0     1

[5 rows x 13 columns]

In [0]:
clean_df_berat= clean_df.drop('Berat Akhir', axis=1)

In [0]:
clean_df_berat.head()

      id  Umur  Kelas Pekerja  ...  Kerugian Capital  Jam per Minggu  Gaji
0  27247    59              3  ...               0.0            50.0     1
1   1640    52              7  ...               0.0            38.0     0
2  45206    52              0  ...               0.0            99.0     1
3  16154    45              7  ...               0.0            40.0     0
4  43023    28              7  ...               0.0            45.0     1

[5 rows x 12 columns]

In [0]:
for column in test_df.columns:
  if test_df[column].dtype != 'int64' and test_df[column].dtype != 'float64':
    test_df[column] = LabelEncoder().fit_transform(test_df[column])

In [0]:
test_df = test_df.drop('Berat Akhir', axis=1)

In [0]:
X_train = clean_df_berat.drop("Gaji", axis=1)
Y_train = clean_df_berat["Gaji"]
X_test  = test_df
X_train.shape, Y_train.shape, X_test.shape

((38393, 11), (38393,), (9599, 11))

In [0]:
logreg = LogisticRegression()
logreg.fit(X_train, Y_train)
Y_pred = logreg.predict(X_test)
acc_log = round(logreg.score(X_train, Y_train) * 100, 2)
acc_log

79.53

In [0]:
coeff_df = pd.DataFrame(train_df.columns.delete(0))
coeff_df.columns = ['Feature']
coeff_df["Correlation"] = pd.Series(logreg.coef_[0])

coeff_df.sort_values(by='Correlation', ascending=False)

                  Feature   Correlation
9        Kerugian Capital  4.604767e-08
8      Keuntungan Kapital  2.206623e-08
7           Jenis Kelamin -9.311187e-10
5       Status Perkawinan -2.480330e-09
2             Berat Akhir -1.194403e-08
6               Pekerjaan -1.303825e-08
4   Jmlh Tahun Pendidikan -1.756873e-08
3              Pendidikan -1.976070e-08
1           Kelas Pekerja -6.782230e-08
10         Jam per Minggu -7.222070e-08
0                    Umur -4.759484e-05
11                   Gaji           NaN

In [0]:
round(coeff_df["Correlation"],5)

0    -0.00005
1    -0.00000
2    -0.00000
3    -0.00000
4    -0.00000
5    -0.00000
6    -0.00000
7    -0.00000
8     0.00000
9     0.00000
10   -0.00000
11        NaN
Name: Correlation, dtype: float64

In [0]:
svc = SVC()
svc.fit(X_train, Y_train)
Y_pred = svc.predict(X_test)
acc_svc = round(svc.score(X_train, Y_train) * 100, 2)
acc_svc

80.23

In [0]:
knn = KNeighborsClassifier(n_neighbors = 3)
knn.fit(X_train, Y_train)
Y_pred = knn.predict(X_test)
acc_knn = round(knn.score(X_train, Y_train) * 100, 2)
acc_knn

88.34

In [0]:
gaussian = GaussianNB()
gaussian.fit(X_train, Y_train)
Y_pred = gaussian.predict(X_test)
acc_gaussian = round(gaussian.score(X_train, Y_train) * 100, 2)
acc_gaussian

79.5

In [0]:
perceptron = Perceptron()
perceptron.fit(X_train, Y_train)
Y_pred = perceptron.predict(X_test)
acc_perceptron = round(perceptron.score(X_train, Y_train) * 100, 2)
acc_perceptron

75.83

In [0]:
linear_svc = LinearSVC()
linear_svc.fit(X_train, Y_train)
Y_pred = linear_svc.predict(X_test)
acc_linear_svc = round(linear_svc.score(X_train, Y_train) * 100, 2)
acc_linear_svc

/usr/local/lib/python3.6/dist-packages/sklearn/svm/_base.py:947: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)

77.57

In [0]:
sgd = SGDClassifier()
sgd.fit(X_train, Y_train)
Y_pred = sgd.predict(X_test)
acc_sgd = round(sgd.score(X_train, Y_train) * 100, 2)
acc_sgd

77.41

In [0]:
decision_tree = DecisionTreeClassifier()
decision_tree.fit(X_train, Y_train)
Y_pred = decision_tree.predict(X_test)
acc_decision_tree = round(decision_tree.score(X_train, Y_train) * 100, 2)
acc_decision_tree

100.0

In [0]:
random_forest = RandomForestClassifier(n_estimators=100)
random_forest.fit(X_train, Y_train)
Y_pred = random_forest.predict(X_test)
random_forest.score(X_train, Y_train)
acc_random_forest = round(random_forest.score(X_train, Y_train) * 100, 2)
acc_random_forest

99.99

In [0]:
models = pd.DataFrame({
    'Model': ['Support Vector Machines', 'KNN', 'Logistic Regression', 
              'Random Forest', 'Naive Bayes', 'Perceptron', 
              'Stochastic Gradient Decent', 'Linear SVC', 
              'Decision Tree'],
    'Score': [acc_svc, acc_knn, acc_log, 
              acc_random_forest, acc_gaussian, acc_perceptron, 
              acc_sgd, acc_linear_svc, acc_decision_tree]})
models.sort_values(by='Score', ascending=False)

                        Model   Score
8               Decision Tree  100.00
3               Random Forest   99.99
1                         KNN   88.34
0     Support Vector Machines   80.23
2         Logistic Regression   79.53
4                 Naive Bayes   79.50
7                  Linear SVC   77.57
6  Stochastic Gradient Decent   77.41
5                  Perceptron   75.83

In [0]:
submission = pd.DataFrame({
        "id": test_df["id"],
        "Gaji": Y_pred
    })

In [0]:
submission.to_csv('tanjidor.csv', index=False)